
type WaterWords = {
  stopWords: string[]
  fillerWords: string[]
}

import stopWordsRu from 'stopwords-ru/stopwords-ru.json' with { type: 'json' }

const stopWordsRuSet = new Set (stopWordsRu)

const waterWords: WaterWords = {
  stopWords: [  // союзы
  'и', 'а', 'но', 'или', 'либо', 'да',
  'если', 'чтобы', 'чтоб', 'когда', 'пока',
  'хотя', 'потому', 'поскольку', 'будто', 'словно',

  // предлоги
  'в', 'во', 'на', 'по', 'к', 'ко', 'с', 'со',
  'из', 'от', 'до', 'за', 'у', 'о', 'об', 'обо',
  'про', 'для', 'при', 'под', 'над', 'перед',
  'между', 'через', 'без', 'около', 'возле',
  'вокруг', 'после', 'против',

  // частицы
  'не', 'ни', 'бы', 'б', 'же', 'ж', 'ли',
  'ведь', 'даже', 'уж', 'уже', 'только',
  'именно', 'вот', 'ну', 'разве', 'почти',

  // личные местоимения
  'я', 'мы', 'ты', 'вы',
  'он', 'она', 'оно', 'они',

  'меня', 'мне', 'мной', 'мною',
  'тебя', 'тебе', 'тобой', 'тобою',
  'его', 'ему', 'им', 'него', 'нему', 'ним',
  'ее', 'её', 'ей', 'ею', 'нее', 'неё',
  'нас', 'нам', 'нами',
  'вас', 'вам', 'вами',
  'их', 'ими', 'них', 'ними',

  // возвратные
  'себя', 'себе', 'собой', 'собою',

  // указательные
  'это', 'этот', 'эта', 'эти', 'этого',
  'этому', 'этим', 'этом', 'этой', 'эту',
  'тот', 'та', 'то', 'те', 'того',
  'тому', 'тем', 'том', 'той', 'ту',

  // определительные
  'весь', 'вся', 'все', 'всё', 'всего',
  'всей', 'всему', 'всем', 'всех',
  'сам', 'сама', 'сами', 'самого', 'самой',

  // вопросительные / относительные
  'кто', 'что', 'какой', 'какая', 'какие',
  'который', 'которая', 'которые',
  'чей', 'чья', 'чье', 'чьё',
  'где', 'куда', 'откуда',
  'как', 'зачем', 'почему', 'чем', 'чего',

  // формы "быть" и связочные
  'быть', 'был', 'была', 'были', 'было',
  'будет', 'будут', 'есть',

  // неопределённые / отрицательные
  'никто', 'ничто', 'ничего',

  // малозначимые связки
  'так', 'такой', 'такая', 'такие',
  'тоже', 'также', 'там', 'тут', 'здесь',
  'тогда', 'теперь'],

  fillerWords: ['вообще',
  'буквально',
  'фактически',
  'реально',
  'просто',
  'пожалуй',
  'конечно',
  'разумеется',
  'действительно',
  'например',
  'скажем',
  'итак',
  'значит',
  'следовательно',
    'безусловно',
    'вероятно',
    'возможно',
    'очевидно',
    'несомненно',
    'собственно',
    'кстати',
    'впрочем',
    'наверное',
    'видимо',
    'допустим',
    'предположим']
}

const waterWordsSet = new Set([...waterWords.stopWords, ...waterWords.fillerWords])
const stopWords = new Set([...waterWords.stopWords])
export { stopWordsRu, stopWordsRuSet, waterWordsSet, stopWords}